Repository/GroupListRepository.php

    public function list(\app\DTO\GroupListDTO $context)
    {
        $db = Group::findAll([
            'organization_id' => $context->organization_id,
            'filial_id' => $context->filial_id
        ]);
---
SELECT * FROM "group" WHERE ("organization_id"=1) AND ("filial_id"=1)