Repository/StatementsUpdateRepository.php

SELECT * FROM "statements" WHERE "id"=78
---
    public function update(\app\DTO\StatementsUpdateDTO $context)
    {
        $db = Statements::findOne(['id' => $context->id]);