Repository/StatementsCreateRepository.php

INSERT INTO "statements" ("user_id", "lesson_id", "user_from", "evaluation_type", "value", "day", "month", "year", "created_at", "updated_at") VALUES (8, 2, 18, 'Ежедневная', '3', '19', '12', '2022', '2022/12/30 08:18:33', '2022/12/30 08:18:33') RETURNING "id"
---
    public function create(\app\DTO\StatementsCreateDTO $context)
    {
        $db = new Statements();
        $db->user_id = $context->user_id;
        $db->lesson_id = $context->lesson_id;
        $db->user_from = $context->user_from;
        $db->evaluation_type = $context->evaluation_type;
        $db->value = $context->value;
        $db->day = $context->day;
        $db->month = $context->month;
        $db->year = $context->year;
        $db->created_at = $context->date_in;
        $db->updated_at = $context->date_in;
        // Проверка валидации
        if ($db->validate())
        {
            $db->save();