Repository/StatementsShowRepository.php

SELECT * FROM "statements" WHERE ("user_id"=3) AND ("lesson_id"=2) AND ("day"='18') AND ("month"='12') AND ("year"='2022')
---
    public function show(\app\DTO\StatementsShowDTO $context)
    {
        $db = Statements::findOne([
            'user_id' => $context->user_id,
            'lesson_id' => $context->lesson_id,
            'day' => $context->day,
            'month' => $context->month,
            'year' => $context->year,
        ]);