Repository/StatementsListRepository.php

SELECT * FROM "statements" WHERE ("user_id"=6) AND ("lesson_id"='2') AND ("month"='12') AND ("year"='2022')
---
    public function list(\app\DTO\StatementsListDTO $context)
    {
        $db = Statements::findAll([
            'user_id' => $context->user_id,
            'lesson_id' => $context->lesson_id,
            'month' => $context->month,
            'year' => $context->year,
        ]);