Repository/TimetableShowTeacherRepository.php

    public function show(\app\DTO\TimetableShowTeacherDTO $context)
    {
        $db = Schedule::findAll([
            'organization_id' => $context->organization_id,
            'teacher_id' => $context->teacher_id,
        ]);
---
SELECT * FROM "schedule" WHERE ("organization_id"=1) AND ("teacher_id"=19)