Repository/TimetableShowRepository.php

    public function show(\app\DTO\TimetableShowDTO $context)
    {
        $db = Schedule::findAll([
            'organization_id' => $context->organization_id,
            'filial_id' => $context->filial_id,
            'group_id' => $context->group_id,
        ]);
---
SELECT * FROM "schedule" WHERE ("organization_id"=1) AND ("filial_id"=1) AND ("group_id"=1)