Repository/UserGroupShowRepository.php

    public function show(\app\DTO\UserGroupShowDTO $context)
    {
        $user_db = Users::findAll([
            'organization_id' => $context->organization_id,
            'filial_id' => $context->filial_id
        ]);

        foreach ($user_db as $value)
        {
            if (trim($value->role) == 'Студент')
            {
                $db = UserGroup::findOne([
                    'group_id' => $context->group_id,
                    'user_id' => $value->id
                ]);
---
SELECT * FROM "users" WHERE ("organization_id"=1) AND ("filial_id"=1)
SELECT * FROM "user_group" WHERE ("group_id"=1) AND ("user_id"=5)