Repository/UserValueListRepository.php

SELECT * FROM "lessons" WHERE "organization_id"=1
SELECT * FROM "statements" WHERE ("user_id"=7) AND ("lesson_id"=1) AND ("month"='1') AND ("year"='2023')
---
    public function show(\app\DTO\UserValueListDTO $context)
    {
        $db_lessons = Lessons::findAll(['organization_id' => $context->organization_id]);

        foreach ($db_lessons as $lesson) {
            $db = Statements::findAll([
                'user_id' => $context->user_id,
                'lesson_id' => $lesson->id,
                'month' => $context->month,
                'year' => $context->year
            ]);